; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v11 ?v7)
             (pred_7 ?v12 ?v13)
             (pred_1 ?v11 ?v13)
             (pred_3 ?v3 ?v11 )
	     (pred_6 ?v11)
             (pred_10 ?v10)
             (pred_9 ?v12)
             (pred_4 ?v13)
             (pred_5 ?v11)
             (pred_8 ?v12)
             (pred_2 ?v11)
             (pred_12 ))



(:action op_2
:parameters (?v4 ?v2 ?v6 ?v8)
:precondition (and (pred_10 ?v4) (pred_10 ?v2) (pred_9 ?v6) (pred_4 ?v8)
          (pred_11 ?v4 ?v2) (pred_7 ?v6 ?v8)
                   (pred_1 ?v2 ?v8) (pred_6 ?v4) 
                   (pred_5 ?v2) (pred_8 ?v6))
:effect (and  (pred_2 ?v2) (not (pred_5 ?v2))))


(:action op_5
:parameters (?v4 ?v1)
:precondition (and (pred_10 ?v4) (pred_10 ?v1)
               (pred_6 ?v4) (pred_11 ?v4 ?v1) (pred_2 ?v1))
:effect (and (pred_6 ?v1) (not (pred_6 ?v4))))

(:action op_1
:parameters (?v4 ?v6)
:precondition (and (pred_10 ?v4) (pred_9 ?v6) 
                  (pred_6 ?v4) (pred_3 ?v6 ?v4) (pred_12 ))
:effect (and (pred_8 ?v6)
   (not (pred_3 ?v6 ?v4)) (not (pred_12 ))))


(:action op_3
:parameters (?v4 ?v5 ?v9)
:precondition (and (pred_10 ?v4) (pred_9 ?v5) (pred_9 ?v9)
                  (pred_6 ?v4) (pred_8 ?v9) (pred_3 ?v5 ?v4))
:effect (and (pred_8 ?v5) (pred_3 ?v9 ?v4)
        (not (pred_8 ?v9)) (not (pred_3 ?v5 ?v4))))

(:action op_4
:parameters (?v4 ?v6)
:precondition (and (pred_10 ?v4) (pred_9 ?v6) 
                  (pred_6 ?v4) (pred_8 ?v6))
:effect (and (pred_12 ) (pred_3 ?v6 ?v4) (not (pred_8 ?v6)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_14 obj_28 obj_27 obj_11 obj_16 obj_05 obj_20 obj_03 obj_24 obj_04 obj_06 obj_18 obj_25 obj_12 obj_26 obj_08 obj_13 obj_10 obj_23 obj_01 obj_17 obj_30 obj_15 obj_09
    obj_21 obj_02
    obj_22 obj_07 obj_29
    )

    (:init
       (pred_12)

       (pred_10 obj_19)
       (pred_10 obj_14)
       (pred_10 obj_28)
       (pred_10 obj_27)
       (pred_10 obj_11)
       (pred_10 obj_16)
       (pred_10 obj_05)
       (pred_10 obj_20)
       (pred_10 obj_03)
       (pred_10 obj_24)
       (pred_10 obj_04)
       (pred_10 obj_06)
       (pred_10 obj_18)
       (pred_10 obj_25)
       (pred_10 obj_12)
       (pred_10 obj_26)
       (pred_10 obj_08)
       (pred_10 obj_13)
       (pred_10 obj_10)
       (pred_10 obj_23)
       (pred_10 obj_01)
       (pred_10 obj_17)
       (pred_10 obj_30)
       (pred_10 obj_15)
       (pred_10 obj_09)
       (pred_4 obj_21)
       (pred_4 obj_02)
       (pred_9 obj_22)
       (pred_9 obj_07)
       (pred_9 obj_29)

       (pred_11 obj_19 obj_16)
       (pred_11 obj_19 obj_14)
       (pred_11 obj_14 obj_05)
       (pred_11 obj_14 obj_28)
       (pred_11 obj_14 obj_19)
       (pred_11 obj_28 obj_20)
       (pred_11 obj_28 obj_27)
       (pred_11 obj_28 obj_14)
       (pred_11 obj_27 obj_03)
       (pred_11 obj_27 obj_11)
       (pred_11 obj_27 obj_28)
       (pred_11 obj_11 obj_24)
       (pred_11 obj_11 obj_27)
       (pred_11 obj_16 obj_04)
       (pred_11 obj_16 obj_05)
       (pred_11 obj_16 obj_19)
       (pred_11 obj_05 obj_06)
       (pred_11 obj_05 obj_20)
       (pred_11 obj_05 obj_14)
       (pred_11 obj_05 obj_16)
       (pred_11 obj_20 obj_18)
       (pred_11 obj_20 obj_03)
       (pred_11 obj_20 obj_28)
       (pred_11 obj_20 obj_05)
       (pred_11 obj_03 obj_25)
       (pred_11 obj_03 obj_24)
       (pred_11 obj_03 obj_27)
       (pred_11 obj_03 obj_20)
       (pred_11 obj_24 obj_12)
       (pred_11 obj_24 obj_11)
       (pred_11 obj_24 obj_03)
       (pred_11 obj_04 obj_26)
       (pred_11 obj_04 obj_06)
       (pred_11 obj_04 obj_16)
       (pred_11 obj_06 obj_08)
       (pred_11 obj_06 obj_18)
       (pred_11 obj_06 obj_05)
       (pred_11 obj_06 obj_04)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_18 obj_25)
       (pred_11 obj_18 obj_20)
       (pred_11 obj_18 obj_06)
       (pred_11 obj_25 obj_10)
       (pred_11 obj_25 obj_12)
       (pred_11 obj_25 obj_03)
       (pred_11 obj_25 obj_18)
       (pred_11 obj_12 obj_23)
       (pred_11 obj_12 obj_24)
       (pred_11 obj_12 obj_25)
       (pred_11 obj_26 obj_01)
       (pred_11 obj_26 obj_08)
       (pred_11 obj_26 obj_04)
       (pred_11 obj_08 obj_17)
       (pred_11 obj_08 obj_13)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_08 obj_26)
       (pred_11 obj_13 obj_30)
       (pred_11 obj_13 obj_10)
       (pred_11 obj_13 obj_18)
       (pred_11 obj_13 obj_08)
       (pred_11 obj_10 obj_15)
       (pred_11 obj_10 obj_23)
       (pred_11 obj_10 obj_25)
       (pred_11 obj_10 obj_13)
       (pred_11 obj_23 obj_09)
       (pred_11 obj_23 obj_12)
       (pred_11 obj_23 obj_10)
       (pred_11 obj_01 obj_17)
       (pred_11 obj_01 obj_26)
       (pred_11 obj_17 obj_30)
       (pred_11 obj_17 obj_08)
       (pred_11 obj_17 obj_01)
       (pred_11 obj_30 obj_15)
       (pred_11 obj_30 obj_13)
       (pred_11 obj_30 obj_17)
       (pred_11 obj_15 obj_09)
       (pred_11 obj_15 obj_10)
       (pred_11 obj_15 obj_30)
       (pred_11 obj_09 obj_23)
       (pred_11 obj_09 obj_15)
       (pred_5 obj_05)
       (pred_5 obj_14)
       (pred_5 obj_10)
       (pred_1  obj_05 obj_21)
       (pred_1  obj_14 obj_02)
       (pred_1  obj_10 obj_21)
       (pred_2 obj_19)
       (pred_2 obj_28)
       (pred_2 obj_27)
       (pred_2 obj_11)
       (pred_2 obj_16)
       (pred_2 obj_20)
       (pred_2 obj_03)
       (pred_2 obj_24)
       (pred_2 obj_04)
       (pred_2 obj_06)
       (pred_2 obj_18)
       (pred_2 obj_25)
       (pred_2 obj_12)
       (pred_2 obj_26)
       (pred_2 obj_08)
       (pred_2 obj_13)
       (pred_2 obj_23)
       (pred_2 obj_01)
       (pred_2 obj_17)
       (pred_2 obj_30)
       (pred_2 obj_15)
       (pred_2 obj_09)

       (pred_7  obj_22 obj_21)
       (pred_7  obj_07 obj_02)
       (pred_7  obj_29 obj_21)
       (pred_3 obj_22 obj_19)
       (pred_3 obj_07 obj_12)
       (pred_3 obj_29 obj_14)
       (pred_6 obj_26)
    )

    (:goal (and
       (pred_3 obj_22 obj_09)
    ))
(:constraints
  (always (not (pred_6 obj_25)))
)
)

; plan
1. (op_5 obj_26 obj_04)
   deleted: (pred_6 obj_26)
   added: (pred_6 obj_04)
   goals met: 0 of 1
2. (op_5 obj_04 obj_16)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_16)
   goals met: 0 of 1
3. (op_5 obj_16 obj_19)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_19)
   goals met: 0 of 1
4. (op_1 obj_19 obj_22)
   deleted: (pred_3 obj_22 obj_19) (pred_12)
   added: (pred_8 obj_22)
   goals met: 0 of 1
5. (op_5 obj_19 obj_16)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_16)
   goals met: 0 of 1
6. (op_5 obj_16 obj_04)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_04)
   goals met: 0 of 1
7. (op_5 obj_04 obj_06)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_06)
   goals met: 0 of 1
8. (op_5 obj_06 obj_18)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_18)
   goals met: 0 of 1
9. (op_5 obj_18 obj_13)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_13)
   goals met: 0 of 1
10. (op_5 obj_13 obj_30)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_30)
   goals met: 0 of 1
11. (op_5 obj_30 obj_15)
   deleted: (pred_6 obj_30)
   added: (pred_6 obj_15)
   goals met: 0 of 1
12. (op_5 obj_15 obj_09)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_09)
   goals met: 0 of 1
13. (op_4 obj_09 obj_22)
   deleted: (pred_8 obj_22)
   added: (pred_12) (pred_3 obj_22 obj_09)
   goals met: 1 of 1
